############################################################################################
# Python是一种面向对象的、解释型的计算机高级程序设计语言，由Guido van Rossum于1989年开始开发，
# 并于1991年发布第一个公开发行版。Python是纯粹的开源自由软件，其源代码和解释器均遵循GPL协议。
# Python具有语法简洁、易于学习、功能强大、可扩展性强、跨平台等诸多特点。
############################################################################################

############################################################################################
# 应用领域：
# 系统编程，可以访问操作系统API，为其编写可移植的系统维护和管理工具。
# GUI编程，内置Tkinter，扩展包有PMW、wxPythonGUI、PythonCard和Dabo。
# Web应用，包含标准Internet模块，可用于实现各种网络任务。
# 组件集成，Python本身由C实现，所以可用C/C++进行扩展。
# 数据库编程，提供主流数据库的API，包括MSSQL，Oracle，MySQL，SQLite，DB2等。
# 数值计算和科学计算，NumPy提供了大量的标准数学库的接口。SciPy和Matplotlib还提供了绘图等功能。
# 游戏、图像、人工智能、机器人、XML等其他领域
############################################################################################

#######################################
# 主要特点：
# 完全免费开源自由
# 面向对象
# 良好的跨平台性
# 动态数据类型、自动内存管理、丰富的内置库及第三方工具
# Python的交互方式下输入输入import this可以看到Python开发人员的设计理念
############################################################################################

############################################################################################
# Python程序的运行方式
# 源代码=>Python解释器=>字节码=>Python虚拟机（该机制与Java、.NET类似）
# 另一种方式：交互方式，直接运行Python指令
############################################################################################

############################################################################################
# Python的实现
# CPython
# Jython
# IronPython
############################################################################################

############################################################################################
# Python程序的可执行文件：冻结二进制文件（Frozen Binary）
# 常用生成Python可执行文件的工具：py2exe，PyInstaller
############################################################################################